{
    "main_dashboard_description": "**The following dashboard showcases insights from graphs and KPIs based on the 365 Data Science database published on https://365datascience.com/news/365-learning-data-challenge/ based on the year 2022 from January to October.**",
    "additional_insights_description": "**The following dashboard showcases additional insights from more graphs and KPIs based on the 365 Data Science database published on https://365datascience.com/news/365-learning-data-challenge/ based on the year 2022 from January to October.**",

    "main_chart_1.1": "The barplot chart provides an insightful overview of student enrollment across different countries. The chart showcases the top five countries with the most substantial student participation: India, the United States, Egypt, Great Britain, and Nigeria.",
    "main_chart_1.2": "India stands out as the leader in terms of student enrollment, followed by the United States. Egypt, securing the third spot, demonstrates a substantial student presence as well. Great Britain and Nigeria, while behind the top three, still contribute significantly to the platform's global user base.",

    "main_chart_2.1": "The barplot chart provides a visual representation of the engagement levels across five prominent countries - USA, India, Great Britain, Canada, and Nigeria - on the platform. The chart showcases the accumulated number of minutes watched by users from these countries.",
    "main_chart_2.2": "- **The United States:** Tops the list with the highest engagement.",
    "main_chart_2.3": "- **India:** Takes second place, though with a notable gap from the United States.",
    "main_chart_2.4": "- **Great Britain:** Stands third, showcasing strong user preference.",
    "main_chart_2.5": "- **Canada:** Claims the fourth spot, indicating consistent online learning adoption.",
    "main_chart_2.6": "- **Nigeria:** Fifth, representing a growing e-learning interest in the region.",
    "main_chart_2.7": "",

    "main_chart_3.1": "The presented dual plot provides an insightful overview of the viewing patterns and trends in the platform's course content over a span of ten months, from January to October. The first plot depicts the cumulative minutes watched by users on the platform for each individual month, while the second plot complements this information with a scatterplot illustrating the average minutes watched per month.",
    "main_chart_3.2": "Notably, the data highlights August as the standout month in terms of course consumption, with the highest amount of minutes watched.",

    "main_chart_4.1": "The presented dual barplot offers an insightful comparison between the number of registered students and the number of onboarded students on the platform, spanning the period from January to October. The vertical axis depicts the count of students, while the horizontal axis corresponds to the months.",
    "main_chart_4.2": "The data reveals a consistent pattern with both registered and onboarded student counts peaking in August. ",

    "additional_insights_chart_1.1": "This dual scatterplot graph provides a side-by-side comparison of two crucial metrics - monthly onboarded students and platform purchases spanning the period from January to October. The x-axis signifies the months of the year, ranging sequentially from January to October, while the y-axis for each scatterplot displays the respective counts of onboarded students and purchases.",
    "additional_insights_chart_1.2": "The month of August stands out with the highest count of onboarded students, signifying a peak in user acquisition during this period. However, it becomes evident that the trend of number of purchases is not uniformly upwards. While the influx of new students in August might have initially suggested a potential correlation, the subsequent months reveal an inconsistent relationship between student onboarding and purchase behavior. Particularly, the month of October presents a divergence from the anticipated pattern, registering the lowest number of purchases across all months.",
    "additional_insights_chart_1.3": "Although, it's important to note that this disparity could be attributed to the data collection only extending up to the 20th day of October, rather than encompassing the entire month. This partial data could have skewed the results, leading to an inaccurate representation of October's purchasing trends.",

    "additional_insights_chart_2.1": "The bar plot provides an insightful overview of student purchases on the platform, categorized by three distinct purchase types: monthly, quarterly, and annual. Each purchase type is represented by its respective bar, and the y-axis indicates the count of student purchases. This visualization offers valuable insights into the preferences and choices of students when it comes to the frequency of their purchases.",
    "additional_insights_chart_2.2": "Among the three available purchase types, the annual choice stands out as the clear favorite.",

    "additional_insights_chart_3.1": "The presented pie chart provides a visual snapshot of the top 5 countries that have demonstrated the highest level of student engagement on the platform: The United States, India, Egypt, Great Britain, and Nigeria. These countries stand out as leaders in actively participating and interacting within the platform's educational ecosystem.",
    "additional_insights_chart_3.2": "- **The United States** stands out as the frontrunner in terms of student engagement.",
    "additional_insights_chart_3.3": "- **India** closely follows the United States in terms of engagement.",
    "additional_insights_chart_3.4": "- **Egypt and Great Britain's** presence among the top 5 countries highlights their active role in the platform's engagement landscape.",
    "additional_insights_chart_3.5": "- **Nigeria** rounds off the list of top 5 engaged countries, signifying the platform's inclusive reach across diverse regions.",
    "additional_insights_chart_3.6": "",

    "additional_insights_chart_4.1": "The barplot provides an insightful overview of the evolving dynamics of question activity on a Q&A hub over the course of ten months, from January to October. Each bar represents a month, and its height signifies the total number of questions asked during that period.",
    "additional_insights_chart_4.2": "Among all the months, August stands out as the pinnacle of user engagement, witnessing the highest number of questions asked.",

    "main_dashboard_summary_1.1": "Through the analysis of the provided graphs, several compelling conclusions emerge regarding user engagement, country representation, and temporal patterns. These insights shed light on user behavior, regional preferences, and significant timeframes:",
    "main_dashboard_summary_1.2": "- **User Engagement Peaks in August:** Notably, the month of August emerges as a pinnacle of user engagement across various metrics, showcasing heightened activity in terms of minutes watched, student registration, and onboarding.",
    "main_dashboard_summary_1.3": "- **Country Distribution and User Engagement:** The top 6 countries with the highest number of students and minutes watched include India, the United States, Egypt, Great Britain, Nigeria, and Canada. These nations collectively form a diverse demographic of engaged learners. Their presence underscores the global reach of the platform, with India and the United States leading in terms of student enrollment.",
    "main_dashboard_summary_1.4": "In summary, August emerges as the pinnacle of user activity, characterized by high enrollment, extensive viewing, and successful onboarding. The top 6 countries, including India, the United States, Egypt, Great Britain, Canada, and Nigeria, consistently drive both student enrollment and minutes watched, reflecting their prominent role in the platform's success. These insights collectively provide valuable guidance for optimizing future engagement strategies and enhancing the learning experience for users around the world.",

    "additional_insights_summary_1.1": "- **August Peak Engagement:** The data across all charts collectively points to August as a month of exceptional user engagement. Both onboarded student numbers and Q&A activity surge during this time, indicating heightened interest, interaction, and involvement with the platform's offerings.",
    "additional_insights_summary_1.2": "- **Annual Purchase Preference:** The annual purchase option stands out as the preferred choice among students. This suggests that users are inclined to commit for longer periods, due to perceived value and benefits associated with this subscription type.",
    "additional_insights_summary_1.3": "- **Geographical Variation:** The disparity in onboarded students across different countries underscores the need to tailor marketing strategies and content to cater to the preferences and needs of diverse regions, potentially unlocking untapped markets.",
    "additional_insights_summary_1.4": "In conclusion, by examining these four distinct charts, it becomes evident that August is a standout month for engagement, the annual purchase type is favored, and the platform's growth trajectory is positive. These insights provide valuable directions for optimizing marketing efforts, content creation, and user engagement strategies moving forward.",

    "ml_introduction_1.1": "**In today's data-driven landscape, understanding user behavior and preferences is paramount for platform success. We will use a Random Forest Classifier, a robust and a versatile machine learning model, to create a system for predicting user tier transitions.**",
    "ml_introduction_1.2": "Our machine learning model aims to classify users of the platform into two distinct categories: free tier users and paid tier users. By understanding user engagement metrics, the platform can better tailor its offerings and predict which users might be more likely to opt for premium features.",
    "ml_introduction_1.3": "",
    "ml_introduction_1.4": "**Key Features and Advantages of Random Forest Classifier:**",
    "ml_introduction_1.5": "- **Ensemble of Decision Trees:** The Random Forest Classifier harnesses the strength of multiple decision trees, each trained on a different subset of the data. This aggregation of decisions results in a robust and resilient model capable of reducing overfitting and enhancing generalization.",
    "ml_introduction_1.6": "- **Non-Linear Relationships:** The platform's user behavior is often characterized by complex, non-linear interactions between various parameters. The Random Forest Classifier adeptly captures these intricate relationships, ensuring accurate classification.",
    "ml_introduction_1.7": "- **Scalability:** As the platform continues to grow, so does the user data. The Random Forest Classifier is amenable to scalability, making it a sustainable choice for future expansion.",
    "ml_introduction_1.8": "",
    "ml_introduction_1.9": "**Features:**",
    "ml_introduction_1.10": "- **Days Engaged Since Registration:** Measures the number of days a user has interacted with the platform since they registered. A higher number indicates consistent usage and commitment to the platform's content.",
    "ml_introduction_1.11": "- **Minutes of Course Watch Time:** Calculates the total minutes a user has spent watching courses on the platform. This metric serves as a strong indicator of the user's investment in the educational content.",
    "ml_introduction_1.12": "- **Engagement with Quizzes:** A binary feature, indicating whether or not the user has engaged with quizzes. Quizzes can be a determining factor in understanding the user's dedication to learning and evaluating their knowledge.",
    "ml_introduction_1.13": "- **Engagement with Exams:** A binary feature, indicating whether or not the user has taken any exams on the platform. Engaging with exams might suggest the user's interest in formal evaluations and their potential need for certifications or more structured learning paths.",
    "ml_introduction_1.14": "- **Engagement with Q&A Hub:** A binary feature, highlighting if a user has interacted with the platform's Q&A hub. This engagement denotes a user's willingness to seek clarifications, participate in discussions, or contribute to the platform's knowledge base.",
    "ml_introduction_1.15": "",
    "ml_introduction_1.16": "For model evaluation we will use precision-recall, f1-score and roc-auc score:",
    "ml_introduction_1.17": "- **Precision:** Precision is the ratio of correctly predicted positive observations to the total predicted positives.",
    "ml_introduction_1.18": "- **Recall (Sensitivity):** Recall is the ratio of correctly predicted positive observations to all the actual positives.",
    "ml_introduction_1.19": "- **F1 Score:** F1 Score is the harmonic mean of precision and recall, two fundamental metrics in classification. ",
    "ml_introduction_1.20": "- **ROC AUC:**  ROC (Receiver Operating Characteristic) curve is a graphical plot that illustrates the true positive rate against the false positive rate at various threshold settings. AUC (Area Under the Curve) quantifies the overall ability of the model to discriminate between positive and negative classes irrespective of the threshold.",
    "ml_introduction_1.21": "",
    "ml_introduction_1.22": "***Note:** True means the student is a paid tier user and False means the student is a free tier user.",
    "ml_introduction_1.23": "",
    "ml_introduction_1.24": "",

    "chatgpt_instructions_1.1": "**Note:** OpenAI accounts come with a free trial of $5 in credit. This credit can be used to access the OpenAI API. Once you have used up your free credit, you will need to pay for additional usage.",
    "chatgpt_instructions_1.2": "- Create an OpenAI account. You can do this by going to the OpenAI website: https://openai.com/ and clicking on the 'Sign Up' button.",
    "chatgpt_instructions_1.3": "- Verify your account. Once you have created an account, you will need to verify your email address.",
    "chatgpt_instructions_1.4": "- Log into your account. Once your account is verified, you can log in to the OpenAI Platform: https://platform.openai.com/.",
    "chatgpt_instructions_1.5": "- Open your personal section. In the top right corner of the page, click on your profile icon.",
    "chatgpt_instructions_1.6": "- Click on 'View API Keys'. This will open the API keys page.",
    "chatgpt_instructions_1.7": "- Click on the 'Create New Secret Key' button.",
    "chatgpt_instructions_1.8": "",
    "chatgpt_instructions_1.9": "You will be prompted to name your API key. You can name it anything you like, but it is a good idea to choose a name that will help you remember what the key is for.",
    "chatgpt_instructions_1.10": "Once you have named your API key, click on the 'Create' button. Your API key will be generated and displayed."
}
