{
    "main_dashboard_description": "**The following dashboard showcases insights from graphs and KPIs based on the 365 Data Science database published on https://365datascience.com/news/365-learning-data-challenge/ based on the year 2022 from January to October.**",
    "additional_insights_description": "**The following dashboard showcases additional insights from more graphs and KPIs based on the 365 Data Science database published on https://365datascience.com/news/365-learning-data-challenge/ based on the year 2022 from January to October.**",

    "main_chart_1": "This chart represents the top 5 countries with the most amount of students based on the year 2022. The country with the most users is India, with almost 7000 students.",
    "main_chart_2": "This chart represents minutes watched on the platform per country. Students from the US have watched almost 500 thousand minutes in total.",
    "main_chart_3": "This chart represents the distribution of minutes watched on the platform by month from January to October. The platform was most active during August, with almost 323 thousand minutes.",
    "main_chart_4": "This chart represents the number of registered students compared to onboarded students. An onboarded student is a user who has done at least one of the following: Watched a video, solved a quiz, or attempted an exam. August was the month with the most amount of students and onboarded students.",

    "additional_insights_chart_1": "This chart represents the distribution of minutes watched on the platform by month from January to October in the year 2022. In August the amount of minutes watched was the highest with the total of almost 323 thousand minutes.",
    "additional_insights_chart_2": "This chart represents the distribution of minutes watched on the platform by month from January to October in the year 2022. In August the amount of minutes watched was the highest with the total of almost 323 thousand minutes.",
    "additional_insights_chart_3": "This chart represents the distribution of minutes watched on the platform by month from January to October in the year 2022. In August the amount of minutes watched was the highest with the total of almost 323 thousand minutes.",
    "additional_insights_chart_4": "This chart represents the distribution of minutes watched on the platform by month from January to October in the year 2022. In August the amount of minutes watched was the highest with the total of almost 323 thousand minutes.",

    "main_dashboard_summary": "Based on **Minutes Watched by Month** and **Number of Registered Students Compared to Onboarded**, July to September were the most active months. Summer break allows students to focus on skill enhancement or learning new subjects they may not have time for during the regular academic year. India and the US are the countries with the most amount of students. India has the most amount of students, yet the US has the most amount of onboarded students.",
    "additional_insights_summary_1": "Based on the additional charts, most paid students prefer the annual subscription, and most engaged students are from the US and India. These charts also show that July to September were the most active months based on **Number of Purchases Compared to Onboarded by Month** and **Questions Asked by Month**. One key note is that the active months don't reflect the trend of monthly purchases (see graph Amount of Purchases by Month). The graph proves an upward trend with inconsistent increase. There could be a few general reasons why this occurs:",
    "additional_insights_summary_2": "- **Engagement vs. Conversion**: While the platform might be active and engaging more students, there could be factors affecting their willingness or ability to make purchases. Engagement measures how involved students are with the platform, but it doesn't guarantee that they will make purchases. Factors such as perceived value or economic conditions could impact the conversion rate.",
    "additional_insights_summary_3": "- **Quality of Engagement**: The increased activity might not necessarily be related to course purchases. Students could be engaging in other activities on the platform, such as free content consumption, rather than making purchases.",

    "machine_learning_description_todo": "Todo",
    "machine_learning_description_todo_bullet_1": "- Why RandomForestClassifier",
    "machine_learning_description_todo_bullet_2": "- Add metrics images such as confusion matrix, roc-auc graph, ",
    "machine_learning_description_todo_bullet_3": "- Add conclusions"
}
